export const regExps = {
  /** 半角英数字、英数字混合必須、8文字以上50文字以下 */
  password: /^(?=.*?[a-z])(?=.*?\d)[a-z\d]{8,50}$/i,
  /** yyyy-mm-dd */
  dateForReq: /^2\d{3}-(0[1-9]|1[0-2])-(0[1-9]|[1-2][0-9]|3[0-1])$/,
  /** yyyy-mm-01 */
  beginningOfMonth: /^2\d{3}-(0[1-9]|1[0-2])-01$/,
  /** HH-MM */
  timeForReq: /^([0-1][0-9]|2[0-3]):[0-5][0-9]$/,
  /** 00:00 から 11:59 まで。秒が続くことがあるので、$ は未使用 */
  timeAM: /^(0[0-9]|1[0-1]):[0-5][0-9]/,
  /**
   * @see https://github.com/colinhacks/zod/blob/master/src/types.ts#L377
   */
  email:
    /^(([^<>()[\]\.,;:\s@\"]+(\.[^<>()[\]\.,;:\s@\"]+)*)|(\".+\"))@(([^<>()[\]\.,;:\s@\"]+\.)+[^<>()[\]\.,;:\s@\"]{2,})$/i,
  url: /https?:\/\/[-_.!~*\'()a-zA-Z0-9;\/?:\@&=+\$,%#]+/g,
} as const;
